# To create dataframe using "Python"

### (it can be out of order)

In [4]:
import pandas as pd

In [5]:
friend_dict_list = [{'name' : 'Jone', 'age' : 20, 'job' : 'student'},
                     {'name' : 'Jenny', 'age' : 30, 'job' : 'developer'},
                     {'name' : 'Nate', 'age' :30, 'job' : 'teacher'}]
df = pd.DataFrame(friend_dict_list)

In [6]:
df.head()

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [7]:
df = df[['name', 'age', 'job']]

In [8]:
df.head()

    name  age        job
0   Jone   20    student
1  Jenny   30  developer
2   Nate   30    teacher

# To create dataframe using "OrderedDict"

### (it cannot be out of order)

In [9]:
from collections import OrderedDict

In [10]:
friend_ordered_dict = OrderedDict([ ('name', ['John', 'Jenny', 'Nate']),
                                  ('age', [20,30,30]),
                                  ('job', ['student', 'developer', 'teacher']) ] )
df = pd.DataFrame.from_dict(friend_ordered_dict)

In [11]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

# To create dataframe using "List"

In [12]:
friend_list = [ ['John', 20, 'student'], ['Jenny', 30, 'developer'], ['Nate', 30, 'teacher'] ]
column_name = ['name','age','job']
df = pd.DataFrame.from_records(friend_list, columns = column_name)

In [13]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [19]:
friend_list = [
                ['name',['John', 'Jenny', 'Nate']],
                ['age',[20,30,30]],
                ['job',['student', 'developer', 'teacher']]
]
df = pd.DataFrame.from_items(friend_list)

/Users/shinchan-yeop/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:6: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.

In [20]:
df.head()

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

# To save dataframe as file

### (with header)

In [29]:
friend_list = [
                ['name',['John','Jenny','Nate']],
                ['age',[20,30,30]],
                ['job',['student','developer','teacher']]
]
df = pd.DataFrame.from_items(friend_list)

/Users/shinchan-yeop/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:6: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.

In [38]:
df.head()

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [39]:
df.to_csv('friend_list_from_df.csv')

### (with no header)

In [36]:
friend_list = [ ['John',20,'student'],['Jenny',30,'developer'],['Nate',30,'teacher'] ]
df = pd.DataFrame.from_records(friend_list)

In [37]:
df.head()

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [40]:
df.to_csv('friend_list_from_df.csv')

### (it can be .txt)

In [41]:
df.to_csv('friend_list_from_df.txt')

### (basically, header and index is set True)

In [42]:
df.to_csv('friend_list_from_df.csv', header = True, index = True)

(header = False : "I dont want to save column name in file",

index = False : "I dont want to save index name in file")

In [43]:
df.to_csv('friend_list_from_df.csv', header = False, index = False)

### how to save column name

In [46]:
df.to_csv('friend_list_from_df.csv', header = ['name', 'age', 'job'])

### Dataframe that has None value

In [53]:
friend_list = [
                ['name',['John', None, 'nate']],
                ['age',[20,None,30]],
                ['job',['student','developer','teacher']]
]
df = pd.DataFrame.from_items(friend_list)

/Users/shinchan-yeop/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:6: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.

In [54]:
df.head()

   name   age        job
0  John  20.0    student
1  None   NaN  developer
2  nate  30.0    teacher

In [55]:
df.to_csv('friend_list_from_df.csv')

### "na_rep" can change None

In [56]:
df.to_csv('friend_list_from_df.csv', na_rep = '-')

In [58]:
a = pd.read_csv('friend_list_from_df.csv')

In [60]:
a

   Unnamed: 0  name   age        job
0           0  John  20.0    student
1           1     -     -  developer
2           2  nate  30.0    teacher